# По двум заданным числам проверить является ли одно квадратом второг

# a = int(input())
# b = int(input())
# c = a * a
# d = b * b
# if c == b:
#     print('Число а является квадратом числа b')
# elif d == a:
#     print('Число b является квадратом числа a')


# Найти максимальное из пяти чисел


# list = [11,22,13,4,15, 44,]
# for i in list:
#     print(i)
# max = list[0]
# for i in range(1, len(list)):
#     if list[i] > max:
#         max = list[i]
# print('Максимальный элемент: ')
# print(max)


# Вывести на экран числа от -N до N

# N = input()
# print(N)
# print(-N)
# for i in range(-N, N):
#     print(-N + 1)

print('Введите число')
a = int(input())
b = -a
while a == b:
    b = b+1
    print(b, a)

#Показать первую цифру дробной части числа

# a = float(input())
# while b < 10:
#     b = a // 10
#     print(b)


